# Start of Exercises
    # Start of Ex 1
        # 🧩 Завдання 1. Привітання користувача

        # Мета: закріпити створення та використання змінних, конкатенацію рядків.

        # Опис:

        # Створи змінні name та age.

        # Присвой їм своє ім’я та вік.

        # Виведи на екран повідомлення такого вигляду:

        # Hello, my name is [ім’я]. I am [вік] years old.
name = "Alex"
age = 27
print("Hello, my name is", name, "I am", age, "years old")
print(" ")
    # Ebd of Ex 1


    # Start of Ex 2
        # 💡 Завдання 2. Обмін значеннями
        #
        # Мета: навчитися змінювати значення змінних і розуміти, як Python працює з присвоєннями.
        #
        # Опис:
        #
        # Створи дві змінні:
        #
        # a = 5
        # b = 10
        #
        #
        # Поміняй їх місцями без використання третьої змінної.
        #
        # Виведи значення до і після обміну:
        #
        # Before: a = 5, b = 10
        # After: a = 10, b = 5
a = 5
b = 10
print("Before:", a, b)
a, b = b, a
print("After:", a, b)
print(" ")
    # End of Ex 2

    # Start of Ex 3
        # 🧮 Завдання 3. Обчислення вартості покупки
        #
        # Мета: практикувати роботу зі змінними числових типів і математичними операціями.
        #
        # Опис:
        #
        # Створи змінні:
        #
        # price_per_item = 25
        # quantity = 4
        # tax_rate = 0.2  # 20%
        #
        #
        # Обчисли загальну суму з податком.
        # Формула:
        #
        # total = price_per_item * quantity * (1 + tax_rate)
        #
        #
        # Виведи результат у зрозумілому форматі, наприклад:
        #
        # Total price (with tax): 120.0
price_per_item = float(25)
quantity = float(4)
tax_rate = float(0.2)  # 20%
total = price_per_item * quantity * (1 + tax_rate)
print(total)
print(" ")
    # End of Ex 3
# End of Exercises